#include <STC89C5xRC.H>
#include "Delay.h"
#include "Timer0.h"
#include "Nixie.h"
#include "Buzzer.h"
//Frequency 频率   FreqTable

//宏定义
sbit Buzzer = P2^5;
#define Speed    100      //由于单片机本身运行代码产生的延迟，程序中音符的时长并未与简谱中的120对应，而是采用100以便与现未闻花名中文歌曲节奏对应
#define Z    0
#define L5    1
#define L5_    2
#define L6    3
#define L6_    4
#define L7    5
#define M1    6
#define M1_    7
#define M2    8
#define M2_    9                  //连音符，合并后重新按键
#define M3    10
#define M4   11
#define M4_    12
#define M5    13
#define M5_    14
#define M6    15
#define M6_   16
#define M7    17
#define H1    18
#define H1_    19
#define H2    20
#define H2_    21
#define H3    22
#define H4   23
#define H4_    24
#define H5    25
#define H5_    26
#define H6    27
#define H6_    28
#define H7    29
#define HH1    30
#define HH1_    31


//全局变量定义
unsigned char FreqSelect;
unsigned int MusicSelect;               //因为Music数组巨大，所以MusicSelect必须使用全局变量，否则会因为溢出不断循环
unsigned int FreqTable[] = {0,64185,64260,64332,64400,64463,64524,64580,64634,64685,64732,64778,64820,64860,64898,64934, 
                         64968,65000,65030,65058,65085,65110,65134,65157,65178,65198,65217,65235,65252,65268,65283,65297,0xFF};
//数组之间的数据需要重新通过定义两个变量，然后通过两个变量才能进行传递
//unsigned char code Music[] = {Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,4,H3,3,H3,1,H3,2,H3,2,H3,2,H2,2,H2,2,H2,2,H2,2,H2,2,Z,2,H2,2,H2,2,H1,2,H1,2,H1,2,H1,3,H1,1,H1,2,H1,2,
//H1,2,M5,2,M5,2,M5,2,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,H5,2,H3,2,H3,3,H3,1,H3,3,H3,1,H2,2,H1,2,H2,2,H3,3,H3,1,H3,2,H3,2,0xFF
//};												 //避免无限制++之后发生数组溢出的问题，在数组后面加入标志位

												 
//相关简谱频率和时长，共3页												 
//第一页音符的频率和时长数据
unsigned int code Music[] = {Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,4,H3,3,H3,3,H3,4,H3,2,H2,2,H2,2,H2,2,H2,2,H2,2,Z,2,H2,4,H1,2,H1,2,H1,2,H1,3,H1,3,H1,4,
M5,2,M5,2,M5,2,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,4,H3,2,H3,3,H3,1,H3,3,H3,1,H2,2,H1,2,H2,4,H3,3,H3,17,
Z,4,H2,2,H3,2,H2,2,H1,3,H1,14,Z,4,Z,4,H2,2,H3,2,H2,4,H1,2,H1,14,H1,4,H1,4,H1,4,H3,4,H3,4,H3,4,H3,4,
H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,H2,4,H2,4,M5,4,M5,4,H3,4,H3,4,H3,4,H3,4,H2,4,H2,4,H2,4,H2,4,H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,H3,4,

Z,4,Z,4,Z,4,Z,4,Z,4,Z,4,Z,4,Z,4,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,4,M7,2,M5,6,Z,2,M5,2,
H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,M7,2,M7,2,M5,6,Z,2,M5,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H2,2,M5,4,M5,6,M5,2,M3,2,
M5,4,M6,2,M6,6,Z,4,Z,4,Z,4,Z,4,Z,4,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,M7,2,M5,6,Z,2,M5,2,
H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,M7,2,M5,6,Z,4,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H2,2,M5,4,M5,4,M5,2,M5,2,M3,2,

M5,2,M6,4,M6,6,M6,4,Z,4,Z,4,Z,4,Z,4,M6,4,M6,4,Z,2,M6,2,M6,2,M5,2,M6,2,M7,2,M7,2,M7,4,M7,2,M7,2,M6,2,
M7,2,H1,2,H1,2,H1,4,M5,4,M3,2,M5,2,M6,2,M6,2,M6,6,Z,4,M6,4,M6,4,Z,2,M6,2,M6,2,M5,2,M6,2,M7,2,M7,2,M7,4,M7,2,M7,2,M6,2,
M7,2,M7,2,H1,2,H1,14,H1,4,Z,4,H2,2,H3,2,H2,4,H1,2,M6,6,H2,2,H3,2,H2,3,H1,3,M6,6,H2,2,H3,2,
H2,3,H1,3,M5,4,M5,2,M5,2,M3,2,M5,2,M6,2,M6,2,M6,6,H3,4,H2,3,H1,3,M6,6, H2,2,H3,2,H2,3,H1,3,M6,2,M6,2,M6,2,H1,4,H2,2,
//第二页音符的频率和时长数据	
H1,20,H1,4,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,4,H3,3,H3,3,H3,4,H3,2,H2,2,H2,2,H2,2,H2,2,H2,2,Z,2,H2,4,
H1,2,H1,2,H1,2,H1,3,H1,3,H1,4,M5,2,M5,2,M5,2,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,4,
H3,2,H3,3,H3,1,H3,3,H3,1,H2,2,H1,2,H2,4,H3,3,H3,17,Z,2,M5,2,H1,2,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,
H2,2,H2,2,H2,4,H2,2,H2,2,H2,2,H2,2,H2,2,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,M5,2,M5,2,M5,4,M5,2,H1,2,H2,1,

H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,Z,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,4,H3,2,H3,13,H3,4,Z,4,H2,2,H3,2,
H2,2,H1,4,H1,14,H1,4,Z,4,H2,2,H3,2,H2,2,H1,4,H1,14,H1,4,H1,4,H1,4,M6,4,M6,4,Z,2,M6,2,M6,2,M5,2,
M6,2,M7,2,M7,2,M7,4,M7,2,M7,2,M6,2,M7,2,H1,2,H1,2,H1,4,M5,4,M3,2,M5,2,M6,2,M6,2,M6,6,Z,4,M6,4,M6,4,Z,2,M6,2,M6,2,M5,2,
M6,2,M7,2,M7,2,M7,4,M7,2,M7,2,M6,2,M7,2,M7,2,H1,2,H1,14,H1,4,Z,4,H2,2,H3,2,H2,3,H1,3,M6,6,H2,2,H3,2, 

H2,3,H1,3,M6,6,H2,2,H3,2,H2,3,H1,3,M5,6,M5,2,M3,2,M5,2,M6,2,M6,2,M6,2,M6,4,H3,4,H2,3,H1,3,M6,6,H2,2,H3,2,
H2,2,H1,4,M6,2,M6,2,M6,2,H1,4,H1,20,H1,4,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,
H2,2,H2,2,H2,4,H2,2,H2,2,H2,2,H2,2,H2,2,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,M5,2,M5,2,M5,4,M5,2,H1,3,H2,1,
H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,Z,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,4,H3,3,H3,13,H3,4,Z,2,M5,2,H2,2,H3,2,
H2,3,H1,17,H1,4,Z,4,H2,2,H3,2,H2,3,H1,3,H1,14,H1,4,H1,4,H2,4,H2,4,H2,4,H1,4,M7,4,M7,4,M7,4,M6,6,M6,2,
//第三页音符的频率和时长数据
M5,20,M5,4,M5,4,M5,4,M6,4,M6,4,M6,4,M6,4,M7,4,M7,4,M7,4,M7,4,H1,20,H1,4,Z,4,Z,4,H2,4,H2,4,H2,4,H1,4,M7,4,M7,4,M6,6,M7,2,
M5,20,M5,4,Z,4,M5,2,M3,2,M5,2,M6,2,M6,2,M6,4,M6,4,M5,2,M6,2,M7,2,M7,2,M7,4,M7,2,M7,2,M6,2,
M7,2,M7,2,H1,2,H1,4,H3,2,H2,2,H1,2,H2,3,H3,3,H3,6,H2,2,H3,2,H2,4,H3,2,M6,6,H2,2,H3,2,H2,3,H1,3,M6,2,M6,2,M6,2,H2,4,H1,20,
H1,4,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,4,H3,2,H3,4,H3,4,H2,2,H2,2,H2,2,H1,2,H2,4,H2,4,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,H1,2,

H1,2,M5,2,M5,2,M5,2,M5,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,4,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,4,H3,3,H3,13,
H3,4,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H2,2,H2,2,H2,4,H2,2,H2,2,H2,4,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,
M5,2,M5,2,M5,4,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,Z,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,3,H3,3,H3,14,
H3,4,Z,2,M5,2,H1,3,H2,1,H2,2,H3,2,H3,4,H3,3,H3,3,H3,4,H2,2,H2,2,H2,2,H1,2,H2,2,H2,6,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,

M5,2,M5,2,M5,4,M5,2,H1,3,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,Z,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,4,H3,3,H3,13,
H3,4,Z,2,M5,2,H1,2,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H2,2,H2,4,H2,2,H2,2,H2,2,H2,2,H2,2,H1,2,H1,2,H1,2,H1,2,H1,4,H1,4,
M5,2,M5,2,M5,4,M5,2,H1,2,H2,1,H2,2,H3,2,H3,2,H3,2,H3,2,H3,2,H3,2,H5,2,Z,2,H3,2,H3,2,H3,2,H3,2,H3,2,H2,2,H1,2,H2,4,H3,2,H3,13,
H3,4,Z,4,H2,2,H3,2,H2,3,H1,3,H1,14,H1,4,Z,4,H2,2,H3,2,H2,3,H1,3,H1,14,H1,4,Z,4,H2,2,H3,2,
H2,3,H1,3,H1,14,H1,4,Z,4,H2,2,H3,2,H2,4,H1,4,H1,28,H1,4,H1,4,H1,4,
0xFF};	                        //这一组数据相比上一组数据考虑了连音符，味道比较标准
//缺点，如果连音线连接的是不同音高的音，那么这些音需要被连贯地演奏，但是在本程序中未能实现
//(因为需要单独禁止关闭TR0，需要另外在数组中设置标志位，但是本简谱中相关连音符仅有两处)


//主函数
void main()
{
	Timer0_Init();
	while(1 < 2)
	{
		if(Music[MusicSelect]!=0xFF)
		{
			FreqSelect = Music[MusicSelect];
			MusicSelect++;
			Delay(Speed*Music[MusicSelect]);         //音符由频率和时长组成，这一部分中断是用来书写音符延迟的
			MusicSelect++;
			TR0 = 0;
			Delay(10);
			TR0 = 1;
		}
		else
		{
			TR0 = 0;                                 //保证结束后不会再启用蜂鸣器
		}
	}
}



//中断函数
void time0_Routine() interrupt 1  
{ 
	if(FreqTable[FreqSelect])                //避免休止符的加入影响中断
	{
		TL0 = FreqTable[FreqSelect] % 256;
		TH0 = FreqTable[FreqSelect] / 256;         //音符由频率和时长组成，这一部分中断是用来书写音符频率的          
//		TL0 = FreqTable[FreqSelect] % 256;
//Delay(1000);             尽量避免将延时函数放到中断内部，会很大程度影响频率并且会阻断主函数的运行 
		Buzzer = !Buzzer;
	}
} 	
