#include <STC89C5xRC.H>

void Timer0_Init()         //括号内的void可写可不写，写代表不需要参数，不写代表可变长度参数
{
	//TMOD = 0x01;              //选择为定时器0，工作模式为01；
  TMOD = TMOD & 0xF0;          //把TMOD的低四位清零，高四位保持不变；                       1010 0011 & 1111 0000 = 1010 0000                   
  TMOD = TMOD | 0x01;          //把TMOD的最低位置1，高四位保持不变；可简化为TMOD| = 0x01;   1010 0000 | 0000 0001 = 1010 0001
	//逻辑或||用于条件判断(布尔逻辑运算)，当有任一条件为真则结果为真,只考虑第一个条件是否真假，不考虑后续条件；
	//按位或|主要用于对位操作，每一位进行比较，如果对应位为1则该位为1；例5|3(0101|0011) = 7(0111)；
	TF0 = 0;                 //这两行都是对TCON的位进行操作
	TR0 = 1;               //使中断标识位置0，启动定时器0；
	TH0 = 0x66;    //给定时器赋初值，定时1ms
	TL0 = 0xFC;    //; 
	ET0 = 1;                 //打开定时器0中断允许
	EA = 1;                 //打开总中断
}	
	
/*      中断模板

void time0_Routine() interrupt 1  
{                                
  static unsigned int timecounter;   
	timecounter++;                      
	TH0 = 64536 / 256;                   
	TL0 = 64536 % 256;
	if (timecounter >= 1000)
	{
		timecounter = 0;
          
	}                    
} 


/*
 * @brief 定时器0初始化，1毫秒@11.0592MHZ
 * @param 无
 * @retval 无
 */
//��� ���� ����ֵ*/